# SQL Server

books:
* Dewson, Robin. **Beginning SQL Server 2012 for Developers**. 2012, 3. edition. Apress.


SQL Server 2022 Query Performance Tuning: Troubleshoot and Optimize Query Performance
https://www.oreilly.com/library/view/sql-server-2022/9781484288917/

SQL Server Query Tuning and Optimization
https://www.oreilly.com/library/view/sql-server-query/9781803242620/

SQL Server T-SQL Recipes, Fourth Edition
https://www.oreilly.com/library/view/sql-server-t-sql/9781484200612/

# 环境

In [1]:
###############################################################################################
# https://github.com/microsoft/mssql-python
# pip install mssql-python

# https://jupysql.ploomber.io/en/latest/integrations/mssql.html
# pip install jupysql
# pip install pyodbc
###############################################################################################

from sqlalchemy import create_engine
from sqlalchemy.engine import URL

def new_engine(host: str = '127.0.0.1',
               port: int = 1433,
               database: str = 'TSQLV6',
               username: str = 'sa',
               password: str = 'admin123!'):
    connection_url = URL.create(
        "mssql+pyodbc",
        username=username,
        password=password,
        host=host,
        port=port,
        database=database,
        query={
            "driver": "ODBC Driver 17 for SQL Server",
            "Encrypt": "no",
            "TrustServerCertificate": "yes",
        },
    )
    return create_engine(connection_url)

engine = new_engine()

In [2]:
%load_ext sql
%sql engine

In [ ]:
# %config SqlMagic.displaylimit = None

# Concepts

`dbo`: database owner, the user who created the databse.

# T-SQL
* [Transact-SQL 参考（数据库引擎）](https://learn.microsoft.com/zh-cn/sql/t-sql/language-reference?view=sql-server-ver16)

books
- T-SQL Fundamentals. - SQL Server 2022

T-SQL: Transact-SQL
- single table queries: `SELECT`
- joins: cross join, inner join, outer join
- subqueries
- table expressions
  - CTE: Common Table Expression
  - iTVF: inline Table-Values Function
  - `APPLY` operator
- set operator: `UNION`, `INTERSECT`, `EXCEPT`
- for data analysis: window functions, pivoting/旋转, unpivoting, grouping sets, time-series data
- data modification: insert, update, delete, merge
- temporal tables: system-versioned temporal tables
- transactions, concurrency: transactions, locks, blocking, isolation levels, deadlocks
- SQL graph: model data using graph-based concepts(nodes, edges)
- programmable objects
- TSQLV6 sample database

data integrity
- declarative: as part of table definitions
  - data type and nullability choices for attributes
  - primary key, unique, foreign key, check, default constraints
  - composite contraints: based on more than one attribute
- procedural: as with stored procedures or triggers

## 数据类型
* [ref](https://learn.microsoft.com/en-us/sql/t-sql/data-types/data-types-transact-sql?view=sql-server-ver16)

- char: 最多256个字符
- nchar: 与`char`类似, 保存Unicode字符
- varchar: 类似于`char`, 变长
- nvarchar: 类似于`nchar`, 变长
- text: 最多8000个字符
- ntext
- image: 存储二进制数据
- int
- bigint
- smallint: -32768 - 32767
- tinyint: 0 - 255
- decimal, numeric: 精确数值
- float, real: 近似数值
- monry
- smallmoney
- date: 0001-01-01 - 9999-12-32
- datetime: 1754-01-01 - 9999-12-31
- datetime2: 比`datetime`更大的秒精度
- smalldatetime: 1900-01-01 - 2079-06-06
- datetimeoffset: 存储相对于指定时间和时区的时间
- time: 24小时时钟
- hierarchyid: 层次, 最大892字节
- geometry: flat Earth地理信息
- geograph: round Earth地理信息
- rowversion: 每个数据库的行唯一的二进制数据
- uniqueidentifier: 全局的唯一标识符GUID
- binary: 二进制, 用于存储标志flag和标志组合
- varbinary: 类似于`binary`, 变长, 超过8000个字符
- bit: 0, 1
- xml

程序数据类型
- cursor: 游标, 没有索引, 一次处理一行
- table: 表, 没有索引, 一次处理所有数据
- sql_variant: 可以持有不同数据类型值的数据类型


列Column
- 默认值
- 生成的IDENTITY值
- NULL值

索引类型:
- clustered: contains the table data itself, define the order of the data in the table
- nonclustered: store ponters to the table data or clustered index as part of the index keys
- unique, nonunique

## 语句
* [ref](https://learn.microsoft.com/en-us/sql/t-sql/statements/statements?view=sql-server-ver16)

```sql
CREATE TABLE [database_name].[schema_name].table_name
  (column_name data_type [length] [IDENTITY(seed, increment)] [NULL/NOT NULL])
```

```sql
CREATE [UNIQUE] [CLUSTERED|NONCLUSTERED]
INDEX index_name
ON table (column [ASC|DESC] [ ,...n ] )
[WITH {IGNORE_DUP_KEY|DROP_EXISTING|SORT_IN_TEMPDB}]
[ON filegroup ]
```

## 查询
* [ref](https://learn.microsoft.com/en-us/sql/t-sql/queries/queries?view=sql-server-ver16)

## 函数
* [ref](https://learn.microsoft.com/en-us/sql/t-sql/functions/functions?view=sql-server-ver16)

# 执行计划
* [ref](https://learn.microsoft.com/zh-cn/sql/relational-databases/performance/execution-plans?view=sql-server-ver17)
* [SqlServer的执行计划如何分析？](https://www.cnblogs.com/for-easy-fast/p/17771172.html)

# 内部体系结构

???

# Ops操作

???

# T-SQL Fundamentals

## Schemas

### Tables

In [ ]:
%sqlcmd tables --schema HR

+-----------+
|    Name   |
+-----------+
| Employees |
+-----------+

In [ ]:
%sqlcmd tables --schema Production

+------------+
|    Name    |
+------------+
| Categories |
|  Products  |
| Suppliers  |
+------------+

In [ ]:
%sqlcmd tables --schema Sales

+--------------+
|     Name     |
+--------------+
|  Customers   |
| OrderDetails |
|    Orders    |
|   Shippers   |
+--------------+

In [ ]:
%sqlcmd tables --schema Stats

+--------+
|  Name  |
+--------+
| Scores |
| Tests  |
+--------+

### Columns

In [ ]:
%sqlcmd columns --schema HR --table Employees

+-----------------+------------------------------------------+----------+---------+---------------+---------+------------------------------+
|       name      |                   type                   | nullable | default | autoincrement | comment |           identity           |
+-----------------+------------------------------------------+----------+---------+---------------+---------+------------------------------+
|      empid      |                 INTEGER                  |  False   |   None  |      True     |   None  | {'start': 1, 'increment': 1} |
|     lastname    | NVARCHAR(20) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
|    firstname    | NVARCHAR(10) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
|      title      | NVARCHAR(30) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
| titleofcourtesy | NVARCHAR(25) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
|    birthdate    |                   DATE                   |  False   |   None  |     False     |   None  |                              |
|     hiredate    |                   DATE                   |  False   |   None  |     False     |   None  |                              |
|     address     | NVARCHAR(60) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
|       city      | NVARCHAR(15) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
|      region     | NVARCHAR(15) COLLATE "Chinese_PRC_CI_AS" |   True   |   None  |     False     |   None  |                              |
|    postalcode   | NVARCHAR(10) COLLATE "Chinese_PRC_CI_AS" |   True   |   None  |     False     |   None  |                              |
|     country     | NVARCHAR(15) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
|      phone      | NVARCHAR(24) COLLATE "Chinese_PRC_CI_AS" |  False   |   None  |     False     |   None  |                              |
|      mgrid      |                 INTEGER                  |   True   |   None  |     False     |   None  |                              |
+-----------------+------------------------------------------+----------+---------+---------------+---------+------------------------------+

## 2 Single-table queries

In [3]:
%%sql
-- LISTING 2-1 Sample query
USE TSQLV6;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

++
||
++
++

In [4]:
%%sql
                                                                  -- logical process order
SELECT empid, YEAR(orderdate) AS orderyear, COUNT(*) AS numorders -- 5
FROM Sales.Orders                                                 -- 1
WHERE custid = 71                                                 -- 2
GROUP BY empid, YEAR(orderdate)                                   -- 3
HAVING COUNT(*) > 1                                               -- 4
ORDER BY empid, orderyear;                                        -- 6

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+-----------+
| empid | orderyear | numorders |
+-------+-----------+-----------+
|   1   |    2021   |     2     |
|   1   |    2022   |     3     |
|   2   |    2022   |     2     |
|   3   |    2021   |     2     |
|   4   |    2022   |     3     |
|   5   |    2021   |     3     |
|   6   |    2021   |     3     |
|   7   |    2022   |     2     |
|   8   |    2021   |     4     |
+-------+-----------+-----------+

In [13]:
%%sql
-- FROM clause
SELECT orderid, custid, empid, orderdate, freight
FROM Sales.Orders;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+---------+--------+-------+------------+----------+
| orderid | custid | empid | orderdate  | freight  |
+---------+--------+-------+------------+----------+
|  10248  |   85   |   5   | 2020-07-04 | 32.3800  |
|  10249  |   79   |   6   | 2020-07-05 | 11.6100  |
|  10250  |   34   |   4   | 2020-07-08 | 65.8300  |
|  10251  |   84   |   3   | 2020-07-08 | 41.3400  |
|  10252  |   76   |   4   | 2020-07-09 | 51.3000  |
|  10253  |   34   |   3   | 2020-07-10 | 58.1700  |
|  10254  |   14   |   5   | 2020-07-11 | 22.9800  |
|  10255  |   68   |   9   | 2020-07-12 | 148.3300 |
|  10256  |   88   |   3   | 2020-07-15 | 13.9700  |
|  10257  |   35   |   4   | 2020-07-16 | 81.9100  |
+---------+--------+-------+------------+----------+
Truncated to displaylimit of 10.

In [12]:
%%sql
-- WHERE clause
SELECT orderid, empid, orderdate, freight
FROM Sales.Orders
WHERE custid = 71;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+---------+-------+------------+----------+
| orderid | empid | orderdate  | freight  |
+---------+-------+------------+----------+
|  10324  |   9   | 2020-10-08 | 214.2700 |
|  10393  |   1   | 2020-12-25 | 126.5600 |
|  10398  |   2   | 2020-12-30 | 89.1600  |
|  10440  |   4   | 2021-02-10 | 86.5300  |
|  10452  |   8   | 2021-02-20 | 140.2600 |
|  10510  |   6   | 2021-04-18 | 367.6300 |
|  10555  |   6   | 2021-06-02 | 252.4900 |
|  10603  |   8   | 2021-07-18 | 48.7700  |
|  10607  |   5   | 2021-07-22 | 200.2400 |
|  10612  |   1   | 2021-07-28 | 544.0800 |
+---------+-------+------------+----------+
Truncated to displaylimit of 10.

In [11]:
%%sql
-- GROUP BY clause: aggregate functions ignore NULL
SELECT
    empid,
    YEAR(orderdate) AS orderyear,
    SUM(freight) AS totalfreight,
    COUNT(*) AS numorders
FROM Sales.Orders
WHERE custid = 71
GROUP BY empid, YEAR(orderdate);

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+--------------+-----------+
| empid | orderyear | totalfreight | numorders |
+-------+-----------+--------------+-----------+
|   1   |    2020   |   126.5600   |     1     |
|   2   |    2020   |   89.1600    |     1     |
|   9   |    2020   |   214.2700   |     1     |
|   1   |    2021   |   711.1300   |     2     |
|   2   |    2021   |   352.6900   |     1     |
|   3   |    2021   |   297.6500   |     2     |
|   4   |    2021   |   86.5300    |     1     |
|   5   |    2021   |   277.1400   |     3     |
|   6   |    2021   |   628.3100   |     3     |
|   7   |    2021   |   388.9800   |     1     |
+-------+-----------+--------------+-----------+
Truncated to displaylimit of 10.

In [10]:
%%sql
SELECT
    empid,
    YEAR(orderdate) AS orderyear,
    COUNT(DISTINCT custid) AS numcusts -- DISTINCT
FROM Sales.Orders
GROUP BY empid, YEAR(orderdate);

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+----------+
| empid | orderyear | numcusts |
+-------+-----------+----------+
|   1   |    2020   |    22    |
|   2   |    2020   |    15    |
|   3   |    2020   |    16    |
|   4   |    2020   |    26    |
|   5   |    2020   |    10    |
|   6   |    2020   |    15    |
|   7   |    2020   |    11    |
|   8   |    2020   |    19    |
|   9   |    2020   |    5     |
|   1   |    2021   |    40    |
+-------+-----------+----------+
Truncated to displaylimit of 10.

In [9]:
%%sql
-- HAVING clause
SELECT empid, YEAR(orderdate) AS orderyear --, COUNT(*)
FROM Sales.Orders
WHERE custid = 71
GROUP BY empid, YEAR(orderdate)
HAVING COUNT(*) > 1;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+
| empid | orderyear |
+-------+-----------+
|   1   |    2021   |
|   3   |    2021   |
|   5   |    2021   |
|   6   |    2021   |
|   8   |    2021   |
|   1   |    2022   |
|   2   |    2022   |
|   4   |    2022   |
|   7   |    2022   |
+-------+-----------+

In [8]:
%%sql
-- SELECT clause
SELECT empid, YEAR(orderdate) AS orderyear, COUNT(*) AS numorders
FROM Sales.Orders
WHERE custid = 71
GROUP BY empid, YEAR(orderdate)
HAVING COUNT(*) > 1;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+-----------+
| empid | orderyear | numorders |
+-------+-----------+-----------+
|   1   |    2021   |     2     |
|   3   |    2021   |     2     |
|   5   |    2021   |     3     |
|   6   |    2021   |     3     |
|   8   |    2021   |     4     |
|   1   |    2022   |     3     |
|   2   |    2022   |     2     |
|   4   |    2022   |     3     |
|   7   |    2022   |     2     |
+-------+-----------+-----------+

In [7]:
%%sql
-- LISTING 2-2 Query returning duplicate rows
SELECT empid, YEAR(orderdate) AS orderyear
FROM Sales.Orders
WHERE custid = 71;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+
| empid | orderyear |
+-------+-----------+
|   9   |    2020   |
|   1   |    2020   |
|   2   |    2020   |
|   4   |    2021   |
|   8   |    2021   |
|   6   |    2021   |
|   6   |    2021   |
|   8   |    2021   |
|   5   |    2021   |
|   1   |    2021   |
+-------+-----------+
Truncated to displaylimit of 10.

In [6]:
%%sql
-- LISTING 2-3 Query with a DISTINCT clause
SELECT DISTINCT empid, YEAR(orderdate) AS orderyear
FROM Sales.Orders
WHERE custid = 71;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+
| empid | orderyear |
+-------+-----------+
|   1   |    2020   |
|   1   |    2021   |
|   1   |    2022   |
|   2   |    2020   |
|   2   |    2021   |
|   2   |    2022   |
|   3   |    2021   |
|   4   |    2021   |
|   4   |    2022   |
|   5   |    2021   |
+-------+-----------+
Truncated to displaylimit of 10.

In [15]:
%%sql
-- LISTING 2-4 Query demonstrating the ORDER BY clause
SELECT empid, YEAR(orderdate) AS orderyear, COUNT(*) AS numorders
FROM Sales.Orders
WHERE custid = 71
GROUP BY empid, YEAR(orderdate)
HAVING COUNT(*) > 1
# ORDER BY empid, orderyear;
ORDER BY 1,2; -- specify ordinal positions of columns

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+-----------+
| empid | orderyear | numorders |
+-------+-----------+-----------+
|   1   |    2021   |     2     |
|   1   |    2022   |     3     |
|   2   |    2022   |     2     |
|   3   |    2021   |     2     |
|   4   |    2022   |     3     |
|   5   |    2021   |     3     |
|   6   |    2021   |     3     |
|   7   |    2022   |     2     |
|   8   |    2021   |     4     |
+-------+-----------+-----------+

In [16]:
%%sql
SELECT empid, firstname, lastname, country
FROM HR.Employees
ORDER BY hiredate; -- not appear in SELECT clause

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+-------+-----------+-----------+---------+
| empid | firstname |  lastname | country |
+-------+-----------+-----------+---------+
|   3   |    Judy   |    Lew    |   USA   |
|   1   |    Sara   |   Davis   |   USA   |
|   2   |    Don    |    Funk   |   USA   |
|   4   |    Yael   |   Peled   |   USA   |
|   5   |    Sven   | Mortensen |    UK   |
|   6   |    Paul   |   Suurs   |    UK   |
|   7   |  Russell  |    King   |    UK   |
|   8   |   Maria   |  Cameron  |   USA   |
|   9   |  Patricia |   Doyle   |    UK   |
+-------+-----------+-----------+---------+

In [ ]:
# %%sql
# SELECT DISTINCT country
# FROM HR.Employees
# ORDER BY empid;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

RuntimeError: (pyodbc.ProgrammingError) ('42000', '[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]ORDER BY items must appear in the select list if SELECT DISTINCT is specified. (145) (SQLExecDirectW)')
[SQL: SELECT DISTINCT country
FROM HR.Employees
ORDER BY empid;]
(Background on this error at: https://sqlalche.me/e/20/f405)
If you need help solving this issue, send us a message: https://ploomber.io/community

## 3 Joins

## 4 Subqueries

## 5 Table expressions

## 6 Set operators

## 7 T-SQL for data analysis

## 8 Data modification

## 9 Temporal tables

## 10 Transactions and concurrency

## 11 SQL Graph

## 12 Programmable objects

## Working with SQL Server Management Studio

In [ ]:
%%sql
SELECT orderid, orderdate FROM Sales.Orders;

Running query in 'mssql+pyodbc://sa:***@127.0.0.1:1433/TSQLV6?Encrypt=no&TrustServerCertificate=yes&driver=ODBC+Driver+17+for+SQL+Server'

+---------+------------+
| orderid | orderdate  |
+---------+------------+
|  10248  | 2020-07-04 |
|  10249  | 2020-07-05 |
|  10250  | 2020-07-08 |
|  10251  | 2020-07-08 |
|  10252  | 2020-07-09 |
|  10253  | 2020-07-10 |
|  10254  | 2020-07-11 |
|  10255  | 2020-07-12 |
|  10256  | 2020-07-15 |
|  10257  | 2020-07-16 |
+---------+------------+
Truncated to displaylimit of 10.